assets/message.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <SendMessage xmlns="http://tempuri.org/">
      <senderid>%s</senderid>
      <friendid>%s</friendid>
      <message>%s</message>
    </SendMessage>
  </soap:Body>
</soap:Envelope>